// file: interfaces.ts

// Інтерфейс для тварин
export interface Animal {
    name: string;
    age: number;
    sound: string;
    makeSound(): void;
}

// Інтерфейс для собак
export interface Dog extends Animal {
    breed: string;
    feed(): void;
}

// Інтерфейс для котів
export interface Cat extends Animal {
    furColor: string;
}


//Визначено три інтерфейси:
//1. Animal - це загальний інтерфейс для всіх тварин, який містить загальну інформацію про тварин, таку як ім'я, вік та звук, який вони видають.
//Крім того, він має метод makeSound(), який потрібно реалізувати в класах-нащадках.
//2. Dog - це інтерфейс для собак, який розширює інтерфейс Animal та містить додаткову інформацію про породу собаки та метод feed(), який потрібно реалізувати в класі Dog.
//3. Cat - це інтерфейс для котів, який розширює інтерфейс Animal та містить додаткову інформацію про колір шерсті кота.